[
  {
    "key": "pool_mode",
    "scope": "Global",
    "section": "pgbouncer",
    "type": "Enum",
    "dynamic": true,
    "range": "[\"session\", \"transaction\", \"statement\"]",
    "default": "session",
    "desc_en": "Specifies when server connections can be reused by other clients. In transaction mode, connections are released back to pool after transaction completes. Reduces the number of PostgreSQL backends needed while providing good performance.",
    "desc_zh": "指定何时可以重用服务器连接。在事务模式下,连接在事务完成后释放回连接池。降低需要的 PostgreSQL 后端数,提供好的性能。"
  },
  {
    "key": "min_pool_size",
    "scope": "Global, Per-database",
    "section": "pgbouncer",
    "type": "Integer",
    "dynamic": true,
    "range": "0 - 2147483647",
    "default": "0",
    "desc_en": "Add more server connections to pool if below this number. Improves behavior when the normal load suddenly comes back after a period of total inactivity. The value is effectively capped at the pool size.",
    "desc_zh": "如果池中连接数低于此值,则添加更多服务器连接到池中。在完全不活动一段时间后,正常负载突然恢复时改善行为。该值实际上被限制在池大小。"
  },
  {
    "key": "default_pool_size",
    "scope": "Global, Per-database, Per-user",
    "section": "pgbouncer",
    "type": "Integer",
    "dynamic": true,
    "range": "0 - 2147483647",
    "default": "20",
    "desc_en": "How many server connections to allow per user/database pair. Can be overridden in the per-database configuration.",
    "desc_zh": "每个用户/数据库对允许多少服务器连接。可以在每个数据库配置中覆盖。"
  },
  {
    "key": "max_client_conn",
    "scope": "Global",
    "section": "pgbouncer",
    "type": "Integer",
    "dynamic": false,
    "range": "1 - 2147483647",
    "default": "100",
    "desc_en": "Maximum number of client connections allowed. Once this limit is reached, new client connections are rejected. Sets the absolute upper bound on how many application connections can be served by this PgBouncer instance.",
    "desc_zh": "允许的最大客户端连接数。一旦达到此限制,将拒绝新的客户端连接。设置 PgBouncer 实例可以服务的应用连接的绝对上限。"
  },
  {
    "key": "max_db_connections",
    "scope": "Global, Per-database",
    "section": "pgbouncer",
    "type": "Integer",
    "dynamic": true,
    "range": "0 - 2147483647",
    "default": "0",
    "desc_en": "Maximum number of server connections per database. When set to 0, the limit is governed by default_pool_size. This setting helps prevent a single database from consuming all available PostgreSQL connections.",
    "desc_zh": "每个数据库的最大服务器连接数。当设置为 0 时,限制由 default_pool_size 管理。此设置有助于防止单个数据库消耗所有可用的 PostgreSQL 连接。"
  },
  {
    "key": "max_user_connections",
    "scope": "Global, Per-user",
    "section": "pgbouncer",
    "type": "Integer",
    "dynamic": true,
    "range": "0 - 2147483647",
    "default": "0",
    "desc_en": "Maximum number of server connections per user. When set to 0, there is no per-user limit. This setting allows administrators to allocate connection resources fairly among different application users or services.",
    "desc_zh": "每个用户的最大服务器连接数。当设置为 0 时,没有每个用户的限制。此设置允许管理员在不同的应用用户或服务之间公平分配连接资源。"
  }
]
